Fuentes/ficohsacore-vortex-7ebad6e8baaa/Middleware/v2/Resources/ConsultaEstadoLote/wsdl/consultaEstadoLotePS.wsdl

<wsdl:definitions name="consultaEstadoLotePS" targetNamespace="http://www.ficohsa.com.hn/middleware.services/pagosMasivosPS/" xmlns:fic="http://www.ficohsa.com.hn/middleware.services/pagosMasivosPS/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:auth="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:cons="http://www.ficohsa.com.hn/middleware.services/pagosMasivosTypes">

  <wsdl:types>
    <xsd:schema>
		<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/autType" schemaLocation="../../esquemas_generales/HeaderElements.xsd"/>
	</xsd:schema>
	<xsd:schema>
		<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/pagosMasivosTypes" schemaLocation="../../PagosMasivos/xsd/pagosMasivosTypes.xsd"/>
	</xsd:schema>
  </wsdl:types> 
  
  	<wsdl:message name="consultaEstadoLoteRequest">
		<wsdl:part element="cons:consultaEstadoLote" name="parameters"/>
		<wsdl:part name="RequestHeader" element="auth:RequestHeader"/>
	</wsdl:message>
	<wsdl:message name="consultaEstadoLoteResponse">
		<wsdl:part element="cons:consultaEstadoLoteResponse" name="result"/>
		<wsdl:part name="ResponseHeader" element="auth:ResponseHeader"/>
	</wsdl:message>
	
	<wsdl:portType name="consultaEstadoLotePS">
		<wsdl:operation name="consultaEstadoLote" parameterOrder="parameters RequestHeader ResponseHeader">
			<wsdl:input message="fic:consultaEstadoLoteRequest"/>
			<wsdl:output message="fic:consultaEstadoLoteResponse"/>
		</wsdl:operation>
	</wsdl:portType>
	
	<wsdl:binding name="consultaEstadoLotePSSOAP" type="fic:consultaEstadoLotePS">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="consultaEstadoLote">
			<soap:operation soapAction="http://www.ficohsa.com.hn/middleware.services/consultaEstadoLotePS/consultaEstadoLote"/>
			<wsdl:input>
				<soap:body use="literal" parts="parameters"/>
				<soap:header message="fic:consultaEstadoLoteRequest" part="RequestHeader" use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" parts="result"/>
				<soap:header message="fic:consultaEstadoLoteResponse" part="ResponseHeader" use="literal"/>
			</wsdl:output>
		</wsdl:operation> 
	</wsdl:binding>
	
	<wsdl:service name="consultaEstadoLotePS">
	    <wsdl:port binding="fic:consultaEstadoLotePSSOAP" name="consultaEstadoLotePSSOAP">
	    	<soap:address location="http://mwomnicanal:8003/Middleware/OperationsAndExecution/Cards/consultaEstadoLote"/>
		</wsdl:port>
	</wsdl:service>
	
</wsdl:definitions>